accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/offers/GetTVPackages-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/ServiceManagement/GetTVPackages">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetTVPackagesResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--1 or more repetitions:-->
               <get:ListOfTv>
                  <!--Optional:-->
                  <get:TvSiid>?</get:TvSiid>
                  <!--Optional:-->
                  <get:RatePlanCode>?</get:RatePlanCode>
                  <!--Optional:-->
                  <get:RatePlanDesc>?</get:RatePlanDesc>
                  <!--Optional:-->
                  <get:ServicePackageCode>?</get:ServicePackageCode>
                  <!--Optional:-->
                  <get:ServicePackageDesc>?</get:ServicePackageDesc>
                  <!--Optional:-->
                  <get:ServiceCode>?</get:ServiceCode>
                  <!--Optional:-->
                  <get:ServiceDesc>?</get:ServiceDesc>
                  <!--Optional:-->
                  <get:MrcCharge>?</get:MrcCharge>
                  <!--Optional:-->
                  <get:YrcCharge>?</get:YrcCharge>
                  <!--Optional:-->
                  <get:Status>?</get:Status>
                  <!--Optional:-->
                  <get:PriceType>?</get:PriceType>
                  <!--Optional:-->
                  <get:FamilyType>?</get:FamilyType>
                  <!--Optional:-->
                  <get:FamilyTypeOrder>?</get:FamilyTypeOrder>
               </get:ListOfTv>
            </lcew:Body>
         </Response>
      </web:GetTVPackagesResponse>
   </soapenv:Body>
</soapenv:Envelope>